yoghapradana/esp8266_ledmatrixdisplay/src/main.cpp
#include <Arduino.h>
#include <MD_Parola.h>
#include <MD_MAX72xx.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <WiFiClient.h>
#include <ArduinoOTA.h>
#include <TimeLib.h>
#include <ESP8266HTTPClient.h>
#include <ArduinoJson.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <EEPROM.h>
#include <ESP8266mDNS.h>
#include <LittleFS.h>

#include "config.h"
#include "localization.h"

// Create display instance
MD_Parola display = MD_Parola(HARDWARE_TYPE, DATA_PIN, CLK_PIN, CS_PIN, MAX_DEVICES);

// AsyncWebServer on Port 80
AsyncWebServer server(80);

WiFiUDP ntpUDP;
// NTP Client with 3-hour update interval (in milliseconds)
NTPClient timeClient(ntpUDP);
DisplaySettings settings; // Global settings struct
Credentials credentials;  // Global credentials struct

// Variables
char timeStr[8] = "00:00"; // HH:MM format with blinking colon + extra char for a/p indicator + null terminator
char dateStr[120] = "";	   // For full date text
// Brightness change times
// [0] = day start time in minutes, [1] = night start time in minutes
uint16_t brightnessTime[2];
String customMessage = "";
uint8_t customMessageRotations = 0;
uint8_t currentRotation = 0;
unsigned long lastTick = 0;
unsigned long lastDateDisplay = 0;
unsigned long lastHijriUpdate = 0;
uint8_t dotAnimationPos = 0;
const char *dotAnimation[] = {".   ", "..  ", "... ", "...."}; // Dot animation frames
unsigned long timeOut = 0;

//-----Flags------//
// OTA Update Status
bool otaEnabled = false;
bool otaActive = false;

bool rebootReq = false;
bool colonVisible = true;
bool showingDate = false;
bool showingCustomMessage = false;
bool reqHijriFetch = false;
bool reqSaveSettings = false;
bool initialFetchDone = false;
bool ntpSyncSuccess = false;

// Islamic date variable
// [0] = day, [1] = month, [2] = year
int hijridates[3];

// ========================================== //
// ===== FORWARD DECLARATIONS (PROTOTYPES) == //
// ========================================== //
void showStatusMessage(const char *msg, textPosition_t alignment = PA_LEFT);
void loadSettings();
void saveSettings();
uint16_t calculateSunEvent(float lat, float lon, int dayOfYear, bool isSunrise, int timeOffset);
void updateBrightness(uint16_t dayStartTime, uint16_t nightStartTime);
void loadCredentials();
void saveCredentials();
void startAPMode();
void handleAPMode();
void showClock();
void showDate();
void showCustomMessage();
void animateClock();
void updateTime();
void animateDate();
void updateDate();
bool fetchHijriDate();
void wifiConnectingAnimation();
void setupOTA();
void setupWebServer();

// ========================================== //
// ===== MAIN SETUP & LOOP ================== //
// ========================================== //

void setup()
{
	display.begin();
	showStatusMessage("BOOT", PA_LEFT);

	EEPROM.begin(512);

	if (!LittleFS.begin())
	{
		showStatusMessage("FS ERR", PA_LEFT);
		// Serial.println("An Error has occurred while mounting LittleFS");
	}

	loadSettings();

	if (settings.autoBrightness)
	{
		brightnessTime[0] = calculateSunEvent(settings.latitude, settings.longitude, day() + (month() - 1) * 30, true, settings.timeOffset);
		brightnessTime[1] = calculateSunEvent(settings.latitude, settings.longitude, day() + (month() - 1) * 30, false, settings.timeOffset);
	}
	brightnessTime[0] = settings.dayStartTime;
	brightnessTime[1] = settings.nightStartTime;
	updateBrightness(settings.dayStartTime, settings.nightStartTime);
	loadCredentials();

	timeClient.setPoolServerName(settings.ntpServer);
	timeClient.setTimeOffset(settings.timeOffset);
	timeClient.setUpdateInterval(3 * 60 * 60 * 1000);

	timeClient.begin();

	WiFi.begin(credentials.ssid, credentials.password);
	unsigned long wifiStartTime = millis();
	while (WiFi.status() != WL_CONNECTED && millis() - wifiStartTime < 20000)
	{
		wifiConnectingAnimation();
		delay(300);
	}

	if (WiFi.status() != WL_CONNECTED)
	{
		showStatusMessage("FAIL", PA_LEFT);
		delay(2000);
		startAPMode();
		timeOut = millis();
	}
	else
	{
		setupOTA();
		otaEnabled = true;
	}

	setupWebServer();

	// Initial NTP Sync
	int retryCount = 0;
	int maxRetries = 15; // Try for 15 seconds
	showStatusMessage("NTP", PA_LEFT);
	timeClient.begin();
	// retries every second until successful, bypassing the normal update interval
	// to avoid getting zero epoch

	while (retryCount < maxRetries)
	{
		if (timeClient.forceUpdate())
		{
			ntpSyncSuccess = true;
			break; // Exit loop early if we get the time!
		}
		retryCount++;
		delay(1000);
	}
	// Last resort incase failure caused by blank NTP server address
	// using default pool.ntp.org, but won't retry if the user set an invalid custom server
	if (!ntpSyncSuccess)
	{
		timeClient.setPoolServerName("pool.ntp.org");
		timeClient.forceUpdate();
		ntpSyncSuccess = timeClient.isTimeSet();
	}
	// TimeLib Sync with NTP Client
	setTime(timeClient.getEpochTime());

	fetchHijriDate();
	showStatusMessage("SYNC", PA_LEFT);

	MDNS.begin("leddisplay");

	showStatusMessage("READY", PA_LEFT);
	delay(1000);
}

void loop()
{
	MDNS.update();

	if (otaEnabled)
	{
		ArduinoOTA.handle();
	}

	if (rebootReq)
	{
		delay(1000);
		ESP.restart();
	}

	if (WiFi.getMode() == WIFI_AP)
	{
		handleAPMode();
		return;
	}

	if (otaActive)
	{
		return;
	}

	if (!ntpSyncSuccess)
	{
		if (display.displayAnimate())
		{
			display.displayScroll("NTP SYNC Failed, Check Network", PA_LEFT, PA_SCROLL_LEFT, SCROLL_SPEED);
		}
		return; // Don't proceed until we have the time, otherwise date-based features won't work
	}

	// Update time and date from NTP
	// actual update happens if timelimit is reached
	updateTime();

	// 1. Trigger at Midnight
	bool isMidnight = (timeClient.getHours() == 0 && timeClient.getMinutes() == 0 && timeClient.getSeconds() == 0);

	// 2. Trigger on Reset (only once after NTP is valid)
	bool isInitialSync = (!initialFetchDone && timeClient.isTimeSet());

	// --- THE HIJRI FETCH BLOCK ---
	if (isMidnight || isInitialSync || reqHijriFetch)
	{
		static int lastFetchedDay = -1;		  // Guard variable
		int currentDay = timeClient.getDay(); // Or day() from TimeLib

		// ONLY fetch if it's a new day, OR if we manually requested via Web/Initial Sync
		if (currentDay != lastFetchedDay || reqHijriFetch || isInitialSync)
		{
			if (fetchHijriDate())
			{
				initialFetchDone = true;
				reqHijriFetch = false;
				lastFetchedDay = currentDay; // Mark this day as done
											 // Serial.println("Hijri Updated Successfully");
			}
			else
			{
				// If it fails, we don't update lastFetchedDay,
				// so it will try again on the next loop iteration.
				// Serial.println("Hijri Fetch Failed. Retrying...");
			}
		}
	}
	// --- END HIJRI FETCH BLOCK ---

	if (reqSaveSettings)
	{
		yield(); // Yield to ensure we don't block other operations
		saveSettings();

