yoghapradana/esp8266_ledmatrixdisplay/src/main.cpp
		if (settings.autoBrightness)
		{
			brightnessTime[0] = calculateSunEvent(settings.latitude, settings.longitude, day() + (month() - 1) * 30, true, settings.timeOffset);
			brightnessTime[1] = calculateSunEvent(settings.latitude, settings.longitude, day() + (month() - 1) * 30, false, settings.timeOffset);
		}
		brightnessTime[0] = settings.dayStartTime;
		brightnessTime[1] = settings.nightStartTime;
		updateBrightness(settings.dayStartTime, settings.nightStartTime);

		updateDate();
		reqSaveSettings = false;
		yield(); // Yield again after updates
	}

	if (showingCustomMessage)
	{
		if (display.displayAnimate())
		{
			currentRotation++;
			if (currentRotation >= customMessageRotations)
			{
				showingCustomMessage = false;
				customMessage = "";
				currentRotation = 0;
				lastDateDisplay = millis();
			}
			else
			{
				showCustomMessage();
			}
		}
		return;
	}

	if (showingDate)
	{
		if (display.displayAnimate())
		{
			showingDate = false;
			lastDateDisplay = millis();
		}
		return;
	}

	if (millis() - lastTick >= TICK_INTERVAL)
	{
		lastTick = millis();
		animateClock();
		showClock();

		static uint8_t lastMinute;
		if (minute() != lastMinute)
		{
			lastMinute = minute();
			updateBrightness(settings.dayStartTime, settings.nightStartTime);
		}
	}

	if (millis() - lastDateDisplay >= CLOCK_DISPLAY_TIMEOUT)
	{
		showingDate = true;
		animateDate();
		showDate();
	}
}

// ========================================== //
// ===== UTILITY & SETTINGS FUNCTIONS ======= //
// ========================================== //

void showStatusMessage(const char *msg, textPosition_t alignment)
{
	display.setFont(nullptr); // Use default font for status messages
	display.displayClear();
	display.setTextAlignment(alignment);
	display.print(msg);
}

// Load settings from EEPROM (bytes 96-120)
void loadSettings()
{
	EEPROM.get(96, settings);

	// Validate settings
	if (settings.dayBrightness > 15)
		settings.dayBrightness = 8;
	if (settings.nightBrightness > 15)
		settings.nightBrightness = 1;
	if (settings.timeOffset < -43200 || settings.timeOffset > 50400)
		settings.timeOffset = 0;
	if (settings.hijriOffset < -2 || settings.hijriOffset > 2)
		settings.hijriOffset = 0;

	// Update NTP client with loaded offset
	timeClient.setTimeOffset(settings.timeOffset);
}

// Save settings to EEPROM
void saveSettings()
{
	EEPROM.put(96, settings);
	EEPROM.commit();
}

void loadCredentials()
{
	EEPROM.get(0, credentials);
	showStatusMessage("OK", PA_LEFT);
}

void saveCredentials()
{
	EEPROM.put(0, credentials);
	EEPROM.commit();
	showStatusMessage("OK", PA_LEFT);
}

// Returns time of sunrise or sunset for given day of year in minutes since midnight (0-1440)
uint16_t calculateSunEvent(float lat, float lon, int dayOfYear, bool isSunrise, int timeOffset)
{

	float declination = -23.45 * cos(2 * PI * (dayOfYear + 10) / 365.0);
	// Calculate the target value for acos
	float acosTarget = -tan(lat * PI / 180.0) * tan(declination * PI / 180.0);
	float hourAngle;

	// EXTREME CASE PROTECTION:
	if (acosTarget >= 1.0)
	{
		// Value > 1 means the sun never rises (Polar Night)
		// We force the hourAngle to 0, meaning Sunrise and Sunset both equal Solar Noon
		hourAngle = 0.0;
	}
	else if (acosTarget <= -1.0)
	{
		// Value < -1 means the sun never sets (Midnight Sun)
		// We force the hourAngle to 180 degrees (12 hours from noon, i.e., 24hr day)
		hourAngle = 180.0;
	}
	else
	{
		// Normal operation
		hourAngle = acos(acosTarget) * 180.0 / PI;
	}

	float solarNoon = 12.0 + (timeOffset / 3600.0) - (lon / 15.0);
	float eventTimeInHours;
	if (isSunrise)
	{
		eventTimeInHours = solarNoon - (hourAngle / 15.0);
	}
	else
	{
		eventTimeInHours = solarNoon + (hourAngle / 15.0);
	}

	// Convert to minutes since midnight
	int32_t minutesSinceMidnight = round(eventTimeInHours * 60.0);

	// Safe signed math guard
	if (minutesSinceMidnight < 0)
	{
		minutesSinceMidnight += 1440;
	}

	// Safe to cast to uint16_t now that the value is guaranteed to be between 0 and 1439
	return (uint16_t)(minutesSinceMidnight % 1440);
}

void updateBrightness(uint16_t dayStartTime, uint16_t nightStartTime)
{
	uint8_t targetBrightness;
	uint16_t currentTime = (hour() * 60) + minute();

	// Check if current time matches day or night start time

	if (dayStartTime < nightStartTime)
	{
		// Normal case: Day starts and ends within the same 24-hour period
		if (currentTime >= dayStartTime && currentTime < nightStartTime)
		{
			targetBrightness = settings.dayBrightness;
		}
		else
		{
			targetBrightness = settings.nightBrightness;
		}
	}
	else
	{
		// Edge case: Day starts before midnight and ends after midnight
		if (currentTime >= dayStartTime || currentTime < nightStartTime)
		{
			targetBrightness = settings.dayBrightness;
		}
		else
		{
			targetBrightness = settings.nightBrightness;
		}
	}
	display.setIntensity(targetBrightness);
}

// ========================================== //
// ===== DISPLAY & ANIMATION FUNCTIONS ====== //
// ========================================== //

void showClock()
{
	display.setTextAlignment(PA_CENTER);
	display.print(timeStr);
}

void showDate()
{
	display.setFont(nullptr);
	display.displayClear();
	display.setTextAlignment(PA_LEFT);
	display.displayScroll(dateStr, PA_LEFT, PA_SCROLL_LEFT, SCROLL_SPEED);
}

void showCustomMessage()
{
	display.setFont(nullptr);
	display.displayClear();
	display.setTextAlignment(PA_LEFT);
	display.displayScroll(customMessage.c_str(), PA_LEFT, PA_SCROLL_LEFT, SCROLL_SPEED);
}

void animateClock()
{
	colonVisible = !colonVisible;

	int h = hour();
	char ampm = (h >= 12) ? 'p' : 'a'; // Determine AM/PM
	if (!settings.is24h)
	{
		h = h % 12;
		if (h == 0)
			h = 12;

		// Format: "12:05a" or "12 05a"
		// Using a narrow font helps this fit on 32 columns
		snprintf(timeStr, sizeof(timeStr), "%2d%c%02d%c",
				 h,
				 colonVisible ? ':' : ' ',
				 minute(),
				 ampm);
	}
	else
	{
		// Standard 24h: "23:05"
		snprintf(timeStr, sizeof(timeStr), "%02d%c%02d",
				 h,
				 colonVisible ? ':' : ' ',
				 minute());
	}
}

