yoghapradana/esp8266_ledmatrixdisplay/src/main.cpp
void animateDate()
{
	unsigned long daysSinceEpoch = now() / 86400;

	String datePart = String(dayWeek[weekday() - 1]);

	if (settings.showPasaran)
	{
		datePart += " " + String(dayPasaran[daysSinceEpoch % 5]);
	}

	datePart += ", " + String(day()) + " " + String(monthNames[month() - 1]) + " " + String(year());

	if (settings.showHijri && hijridates[0] > 0)
	{
		datePart += " / " + String(hijridates[0]) + " " + String(hijriMonths[hijridates[1] - 1]) + " " + String(hijridates[2]) + "H";
	}

	datePart.toCharArray(dateStr, sizeof(dateStr));
}

// ========================================== //
// ===== TIME & DATE FUNCTIONS ============== //
// ========================================== //

void updateTime()
{
	timeClient.update();
	time_t epochTime = timeClient.getEpochTime();
	setTime(epochTime);
}

void updateDate()
{
	updateTime(); // Ensure time is updated before calculating date
	unsigned long daysSinceEpoch = now() / 86400;

	snprintf(dateStr, sizeof(dateStr), "%s %s, %d %s %d / %d %s %dH",
			 dayWeek[weekday() - 1],
			 dayPasaran[daysSinceEpoch % 5],
			 day(),
			 monthNames[month() - 1],
			 year(),
			 hijridates[0],
			 hijriMonths[hijridates[1] - 1],
			 hijridates[2]);
}

bool fetchHijriDate()
{
	WiFiClient client;
	HTTPClient http;

	// 1. Calculate the 'Target Date' for the API
	// Instead of asking for 'Today', we ask for 'Today + Offset'
	time_t current_time = now();					// Get current time in seconds since epoch
	current_time += (settings.hijriOffset * 86400); // Add/Subtract days in seconds

	struct tm *t = localtime(&current_time);

	char dateBuffer[11];
	strftime(dateBuffer, sizeof(dateBuffer), "%d-%m-%Y", t);

	String url = String(HIJRI_API_URL) + "/" + String(dateBuffer);

	if (http.begin(client, url))
	{
		int httpCode = http.GET();
		if (httpCode == HTTP_CODE_OK)
		{
			String payload = http.getString();
			JsonDocument doc;
			DeserializationError error = deserializeJson(doc, payload);
			if (!error)
			{
				JsonObject hijri = doc["data"]["hijri"];
				hijridates[0] = hijri["day"];
				hijridates[1] = hijri["month"]["number"];
				hijridates[2] = hijri["year"];

				http.end();
				return true; // Successfully updated Hijri date
			}
		}
		http.end();
	}
	return false; // Failed to fetch or parse Hijri date
}

// ========================================== //
// ===== NETWORK & WEB FUNCTIONS ============ //
// ========================================== //

void startAPMode()
{
	WiFi.mode(WIFI_AP);
	WiFi.softAP(AP_SSID, AP_PASSWORD);
}

void handleAPMode()
{
	static String apMessage = "";

	if (apMessage.length() == 0)
	{
		IPAddress apIP = WiFi.softAPIP();
		apMessage = "WiFi: " + String(AP_SSID) + " | Password: " + String(AP_PASSWORD) + " | Config: http://" + apIP.toString();
	}

	if (display.displayAnimate())
	{
		display.displayScroll(apMessage.c_str(), PA_LEFT, PA_SCROLL_LEFT, SCROLL_SPEED);
	}

	if (millis() - timeOut >= AP_MODE_TIMEOUT)
	{
		rebootReq = true;
	}
}

void wifiConnectingAnimation()
{
	showStatusMessage(dotAnimation[dotAnimationPos], PA_LEFT);
	dotAnimationPos = (dotAnimationPos + 1) % 4;
}

void setupOTA()
{
	ArduinoOTA.setHostname(OTA_HOSTNAME);
	ArduinoOTA.setPassword(OTA_PASSWORD);

	ArduinoOTA.onStart([]()
					   {
    otaActive = true;
    showStatusMessage("OTA", PA_LEFT); });

	ArduinoOTA.onEnd([]()
					 {
    showStatusMessage("DONE", PA_LEFT);
    delay(1000);
    ESP.restart(); });

	ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
						  {
    char progressMsg[5];
    snprintf(progressMsg, sizeof(progressMsg), "%2d%%", (progress * 100) / total);
    showStatusMessage(progressMsg, PA_LEFT); });

	ArduinoOTA.onError([](ota_error_t error)
					   {
    const char *errorMsg = "ERR";
    if (error == OTA_AUTH_ERROR) errorMsg = "AUTH";
    else if (error == OTA_BEGIN_ERROR) errorMsg = "BEGN";
    showStatusMessage(errorMsg, PA_LEFT);
    delay(2000); 
	ESP.restart(); });

	ArduinoOTA.begin();
}

void setupWebServer()
{
	server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
			  {
    // 1. File System (LittleFS)
    // 2. File Path ("/index.html")
    // 3. Content-Type + Charset ("text/html; charset=utf-8")
    // 4. Download flag (false = display in browser, true = force download) - optional
    // 5. Template processor (htmlProcessor) - optional, used for dynamic content replacement in HTML files (serverside rendering)
    
    request->send(LittleFS, "/index.html", "text/html; charset=utf-8"); });

	// serve static files
	server.serveStatic("/", LittleFS, "/");

	server.on("/saveCredentials", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
			  {
        JsonDocument doc;
        // Using 'total' ensures we consider the expected length of the body
        DeserializationError error = deserializeJson(doc, data, len);

        if (!error) {
        // Use strlcpy for safer copying than strncpy (it handles null-termination automatically)
        strlcpy(credentials.ssid, doc["ssid"] | "", sizeof(credentials.ssid));
        strlcpy(credentials.password, doc["password"] | "", sizeof(credentials.password));

        saveCredentials();
        request->send(200, "text/plain", "OK");
        rebootReq = true;
    } else {
        request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
    } });

	server.on("/show", HTTP_GET, [](AsyncWebServerRequest *request)
			  {
    if (request->hasParam("message")) {
      customMessage = request->getParam("message")->value();

      customMessageRotations = 2;
      if (request->hasParam("rotations")) {
        customMessageRotations = request->getParam("rotations")->value().toInt();
        if (customMessageRotations < 1) customMessageRotations = 1;
        if (customMessageRotations > 10) customMessageRotations = 10;
      }

