yoghapradana/esp8266_ledmatrixdisplay/src/main.cpp
      customMessage.replace("+", " ");
      customMessage.replace("%20", " ");

      showingCustomMessage = true;
      currentRotation = 0;
      showCustomMessage();

      request->send(200, "text/plain", "Message set: " + customMessage);
    } else {
      request->send(400, "text/plain", "Missing 'message' parameter.");
    } });

	server.on("/settings", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total)
			  {
        JsonDocument doc;
        // Using 'total' ensures we consider the expected length of the body
        DeserializationError error = deserializeJson(doc, data, len);

        if (!error)
        {
          // 1. Brightness Mode (Boolean)
          if (doc["autoBrt"].is<bool>())
          {
            settings.autoBrightness = doc["autoBrt"];
          }

          // 2. Numeric & Bool values
          if (doc["tmOft"].is<int>())
          {
            settings.timeOffset = doc["tmOft"];
            timeClient.setTimeOffset(settings.timeOffset);
          }
          if (doc["hjrOft"].is<int>())
          {
            int newHijriOffset = doc["hjrOft"];
            if (settings.hijriOffset != newHijriOffset)
            {
              //update offset if new value received and trigger API fetch request
              settings.hijriOffset = newHijriOffset;
              reqHijriFetch = true; // Trigger a fetch with the new offset
            }
          }
          if (doc["dBrt"].is<int>())
            settings.dayBrightness = doc["dBrt"];

          if (doc["ntBrt"].is<int>())
            settings.nightBrightness = doc["ntBrt"];

          if (doc["dST"].is<int>())
            settings.dayStartTime = doc["dST"];

          if (doc["nST"].is<int>())
            settings.nightStartTime = doc["nST"];

          if (doc["showHjr"].is<bool>())
            settings.showHijri = doc["showHjr"];

          if (doc["showPsr"].is<bool>())
            settings.showPasaran = doc["showPsr"];

          // 3. Float values
          if (doc["lat"].is<float>())
            settings.latitude = doc["lat"];

          if (doc["long"].is<float>())
            settings.longitude = doc["long"];

          if (doc["is24"].is<bool>())
          {
            settings.is24h = doc["is24"];
          }

		  if (doc["ntpSrv"].is<const char*>())
		  {
			  strlcpy(settings.ntpServer, doc["ntpSrv"], sizeof(settings.ntpServer));
			  timeClient.setPoolServerName(settings.ntpServer);
		  }

          // IMPORTANT: Send response BEFORE potentially heavy EEPROM/Update functions
          request->send(200, "text/plain", "OK");
          delay(10); // Small delay to ensure response is sent before we do heavy lifting

          // Now perform the hardware updates
          reqSaveSettings = true; // Flag to indicate we need to save settings after response
          
        }
        else
        {
          request->send(400, "text/plain", "JSON Error");
        } });

	server.on("/getsettings", HTTP_GET, [](AsyncWebServerRequest *request)
			  {
    JsonDocument doc;
	doc["ssid"] =
        credentials.ssid[0] != '\0'
        ? credentials.ssid
        : "Not set";
	if (WiFi.status() == WL_CONNECTED)
    {
        doc["wifiStat"] ="Connected";
		doc["ip"] = WiFi.localIP().toString();
    }
    else if (credentials.ssid[0] != '\0')
    {
        doc["wifiStat"] = "Saved but not connected";
    }
    else
    {
        doc["wifiStat"] = "No saved network";
    }

    doc["tmOft"] = settings.timeOffset;
    doc["autoBrt"] = settings.autoBrightness;
    doc["dBrt"] = settings.dayBrightness;
    doc["ntBrt"] = settings.nightBrightness;
    doc["dSH"] = settings.dayStartTime / 60; // Convert back to hours for response
    doc["dSM"] = settings.dayStartTime % 60; // Convert back to minutes for response
    doc["nSH"] = settings.nightStartTime / 60; // Convert back to hours for response
    doc["nSM"] = settings.nightStartTime % 60; // Convert back to minutes for response
    doc["lat"] = settings.latitude;
    doc["long"] = settings.longitude;
    doc["showHjr"] = settings.showHijri;
    doc["showPsr"] = settings.showPasaran;
    doc["hjrOft"] = settings.hijriOffset;
    doc["tmOft"] = settings.timeOffset;
    doc["is24"] = settings.is24h;
    doc["ntpSrv"] = settings.ntpServer;
    String output;
    serializeJson(doc, output);
    request->send(200, "application/json", output); });

	server.begin();
	showStatusMessage("OK", PA_LEFT);
}
